In [1]:
import pandas as pd

In [2]:
stores = pd.read_csv('C:/Users/User/Desktop/PYTHON/Data Sets/stores.csv')

In [3]:
# outlier treatment
print(stores.TotalSales.min())
print(stores.TotalSales.quantile(.01))
print(stores.TotalSales.max())
print(stores.TotalSales.quantile(.99))

71.1
72.526
472.0
468.28000000000003

In [3]:
# from the above any data less than 72.526 we want to clip it to 72.526
# from the above any data more than 468.28 we want to clip it to 468.28
# stores.TotalSales.clip(lower = 72.526, upper = 468.28)

stores.TotalSales.clip(lower = stores.TotalSales.quantile(.01), upper = stores.TotalSales.quantile(.99))

0     160.000
1     160.000
2     108.000
3     258.000
4     360.000
5     225.000
6     360.000
7     146.700
8     140.800
9     167.600
10    167.600
11    275.800
12    275.800
13    275.800
14    468.280
15    460.000
16    440.000
17     78.700
18     75.700
19     72.526
20    120.100
21    318.000
22    304.000
23    350.000
24    400.000
25     79.000
26    120.300
27     95.100
28    351.000
29    145.000
30    301.000
31    121.000
Name: TotalSales, dtype: float64

In [4]:
# if i want to check the values that which values are changed/clipped then -- 

pd.concat([stores.TotalSales, stores.TotalSales.clip(lower = stores.TotalSales.quantile(.01), 
                                                     upper = stores.TotalSales.quantile(.99))], axis = 1)

    TotalSales  TotalSales
0        160.0     160.000
1        160.0     160.000
2        108.0     108.000
3        258.0     258.000
4        360.0     360.000
5        225.0     225.000
6        360.0     360.000
7        146.7     146.700
8        140.8     140.800
9        167.6     167.600
10       167.6     167.600
11       275.8     275.800
12       275.8     275.800
13       275.8     275.800
14       472.0     468.280
15       460.0     460.000
16       440.0     440.000
17        78.7      78.700
18        75.7      75.700
19        71.1      72.526
20       120.1     120.100
21       318.0     318.000
22       304.0     304.000
23       350.0     350.000
24       400.0     400.000
25        79.0      79.000
26       120.3     120.300
27        95.1      95.100
28       351.0     351.000
29       145.0     145.000
30       301.0     301.000
31       121.0     121.000

In [ ]:
# Joins and stack are different

For join there should be some common values
For hstack/vstack no common column required

# Creating summaries/aggregations in Python

In [ ]:
# when we have one field in the rows and one field in columns -- Cross table or wide table 
# when both fields are made in one column then it is known as long data or hirarcyal data 

# create the summaries in python - 2 step process
    1. Create the group by object df.groupby(), df.groupby([])
    2. create a summary/aggregation .sum() .mean()   .agg()   , apply() and lambda function

In [6]:
# Step1: create the group by object

grpdata = stores.groupby('Location')

In [7]:
grpdata.TotalSales.sum()

Location
Chennai    2235.4
Delhi      1777.7
Kolkata    1612.4
Mumbai     1757.6
Name: TotalSales, dtype: float64

In [8]:
# Step2: create a summary/aggregation

grpdata.TotalSales.sum().reset_index()

  Location  TotalSales
0  Chennai      2235.4
1    Delhi      1777.7
2  Kolkata      1612.4
3   Mumbai      1757.6

In [9]:
# you can write the 2 steps in one line as well 
# get the total sales for each location

stores.groupby('Location').TotalSales.sum().reset_index()

  Location  TotalSales
0  Chennai      2235.4
1    Delhi      1777.7
2  Kolkata      1612.4
3   Mumbai      1757.6

In [16]:
# Signature: stores.TotalSales.agg(func, axis=0, *args, **kwargs)
# Docstring: Aggregate using one or more operations over the specified axis.

stores.TotalSales.agg?

In [10]:
# get total and average Sales for each location
# stores.groupby('Location').TotalSales.agg([sum(), mean(), min(), max(), std()]).reset_index()

stores.groupby('Location').TotalSales.agg(['sum', 'mean', 'min', 'max', 'std']).reset_index()

  Location     sum      mean    min    max         std
0  Chennai  2235.4  279.4250  140.8  472.0  127.592227
1    Delhi  1777.7  222.2125  108.0  360.0   96.914343
2  Kolkata  1612.4  201.5500   79.0  400.0  127.753043
3   Mumbai  1757.6  219.7000   71.1  440.0  148.756119

In [11]:
# get the total sales and total operating cost for each Location
# here i need to use [[]] as there are multiple columns and the . operator will get me only one column

stores.groupby('Location')[['TotalSales', 'OperatingCost']].sum().reset_index()

  Location  TotalSales  OperatingCost
0  Chennai      2235.4          129.5
1    Delhi      1777.7          161.7
2  Kolkata      1612.4          174.8
3   Mumbai      1757.6          176.9

In [12]:
# get the total and average sales and operating cost for each Location

stores.groupby('Location')[['TotalSales', 'OperatingCost']].agg(['sum', 'mean']).reset_index()

  Location TotalSales           OperatingCost
                  sum      mean           sum     mean
0  Chennai     2235.4  279.4250         129.5  16.1875
1    Delhi     1777.7  222.2125         161.7  20.2125
2  Kolkata     1612.4  201.5500         174.8  21.8500
3   Mumbai     1757.6  219.7000         176.9  22.1125

In [13]:
# get the total sales and average operating cost for each Location

stores.groupby('Location')[['TotalSales', 'OperatingCost']].agg({'TotalSales': 'sum', 'OperatingCost':'mean'})

          TotalSales  OperatingCost
Location
Chennai       2235.4        16.1875
Delhi         1777.7        20.2125
Kolkata       1612.4        21.8500
Mumbai        1757.6        22.1125

In [14]:
# get total sales for each Location and Store Type
# this is giving us long data hence, we will convert it to wide data as wide data is a better view

stores_summ = stores.groupby(['Location', 'StoreType']).TotalSales.sum().reset_index()

In [15]:
stores_summ

   Location     StoreType  TotalSales
0   Chennai       Apparel       915.4
1   Chennai  Electronincs       600.8
2   Chennai  Super Market       719.2
3     Delhi       Apparel       745.0
4     Delhi  Electronincs       306.7
5     Delhi  Super Market       726.0
6   Kolkata       Apparel       525.0
7   Kolkata  Electronincs       521.0
8   Kolkata  Super Market       566.4
9    Mumbai       Apparel       700.7
10   Mumbai  Electronincs       790.0
11   Mumbai  Super Market       266.9

In [22]:
# pivot -- Signature: stores_summ.pivot(index=None, columns=None, values=None)
# Docstring: Return reshaped DataFrame organized by given index / column values.

stores_summ.pivot?

In [16]:
# converting long data to wide data (cross view table)

stores_summ.pivot('Location', 'StoreType', 'TotalSales')

StoreType  Apparel  Electronincs  Super Market
Location
Chennai      915.4         600.8         719.2
Delhi        745.0         306.7         726.0
Kolkata      525.0         521.0         566.4
Mumbai       700.7         790.0         266.9

In [ ]:
# .melt -- Signature: stores_summ.melt(id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None,)
# Docstring: Unpivots a DataFrame from wide format to long format, optionally leaving identifier variables set.

In [24]:
# converting wide data to long data we have .melt
stores_summ.melt?

In [25]:
# If we want to all the steps in one step then use 

stores.pivot_table?

In [ ]:
# Signature: stores.pivot_table( values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False,
    dropna=True, margins_name='All',)
# Docstring: Create a spreadsheet-style pivot table as a DataFrame. The levels in the pivot table will be stored in MultiIndex 
# objects (hierarchical indexes) on the index and columns of the result DataFrame.

In [17]:
stores.pivot_table(index = 'Location', columns = 'StoreType', 
                       values = 'TotalSales', aggfunc = 'sum')

StoreType  Apparel  Electronincs  Super Market
Location
Chennai      915.4         600.8         719.2
Delhi        745.0         306.7         726.0
Kolkata      525.0         521.0         566.4
Mumbai       700.7         790.0         266.9

In [18]:
# Cross table/ wide table using pivot_table
# margins = True will give the total of all columns

stores.pivot_table(index = 'Location', columns = 'StoreType', 
                       values = 'TotalSales', aggfunc = 'sum', margins = True)

StoreType  Apparel  Electronincs  Super Market     All
Location
Chennai      915.4         600.8         719.2  2235.4
Delhi        745.0         306.7         726.0  1777.7
Kolkata      525.0         521.0         566.4  1612.4
Mumbai       700.7         790.0         266.9  1757.6
All         2886.1        2218.5        2278.5  7383.1

In [19]:
# Long table using pivot_table

stores.pivot_table(index = ['Location', 'StoreType'], values='TotalSales', aggfunc=['sum', 'mean']).reset_index()

   Location     StoreType        sum        mean
                          TotalSales  TotalSales
0   Chennai       Apparel      915.4  305.133333
1   Chennai  Electronincs      600.8  300.400000
2   Chennai  Super Market      719.2  239.733333
3     Delhi       Apparel      745.0  248.333333
4     Delhi  Electronincs      306.7  153.350000
5     Delhi  Super Market      726.0  242.000000
6   Kolkata       Apparel      525.0  175.000000
7   Kolkata  Electronincs      521.0  260.500000
8   Kolkata  Super Market      566.4  188.800000
9    Mumbai       Apparel      700.7  233.566667
10   Mumbai  Electronincs      790.0  395.000000
11   Mumbai  Super Market      266.9   88.966667

# Date & Time

In [1]:
import pandas as pd

In [2]:
Q1 = pd.read_csv('C:/Users/User/Desktop/PYTHON/Data Sets/POS_Q1.csv')

In [3]:
Q1

,Date,Configuration,Customer Postcode,Store Postcode,Retail Price,month
0,01-01-13 0:01,163,EC4V 5BH,SE1 2BN,455,1
1,01-01-13 0:02,320,SW4 0JL,SW12 9HD,545,1
2,01-01-13 0:04,23,EC3V 1LR,E2 0RY,515,1
3,01-01-13 0:04,169,SW1P 3AU,SE1 2BN,395,1
4,01-01-13 0:06,365,EC4V 4EG,SW1V 4QQ,585,1

In [10]:
# here Date is object type and we cannot perform any operation when the column is not a proper date & time

Q1.dtypes

Date                 object
Configuration         int64
Customer Postcode    object
Store Postcode       object
Retail Price          int64
month                 int64
dtype: object

In [ ]:
# suppose i have date in string and we want to get the year. it is not possible . first we have to change the type and then 
we have to perform any operation

'18-Aug-2019'

In [ ]:
# in pandas there are to methods for changing the date to proper date and time
# in most of the cases the numbers are stored as text values and to convert them back to numbers or date & time we will make 
use of these 2 things only

pd.to_datetime()
pd.to_numeric() -- converts object type data to numeric
series.astype() -- converts numeric data to object type, also converts numbers to categorical type

In [11]:
Q1.Date

0    01-01-13 0:01
1    01-01-13 0:02
2    01-01-13 0:04
3    01-01-13 0:04
4    01-01-13 0:06
Name: Date, dtype: object

In [ ]:
# this method has converted the date column from object to datetime 
Name: Date, dtype: datetime64[ns]

In [12]:
pd.to_datetime(Q1.Date)

0   2013-01-01 00:01:00
1   2013-01-01 00:02:00
2   2013-01-01 00:04:00
3   2013-01-01 00:04:00
4   2013-01-01 00:06:00
Name: Date, dtype: datetime64[ns]

In [ ]:
# to instruct the tool how to read the date we need to give instruction to python by writing format
Eg. mm-dd-yyyy

In [14]:
dob = '07-04-2000'

In [15]:
pd.to_datetime(dob)

Timestamp('2000-07-04 00:00:00')

In [ ]:
# instruction to python 
Datetime conversion

%d -- refers to date 
%a -- mon, sun, tue
%A -- monday, sunday, tuesday

%m -- refers to month
%b -- jan, feb, mar
%B -- january, february, march

%y -- refers to year without the century 19, 20, 80
%Y -- 2019, 2020, 1980

Time 
%H -- hours in 24hrs format
%I(%p) -- hours in 12hrs format with a.m., p.m. (%p)

%M -- minutes
%S -- seconds

In [30]:
# Signature:pd.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=None, box=True, format=None, exact=True,
    unit=None, infer_datetime_format=False, origin='unix', cache=False,)
# Docstring: Convert argument to datetime.

pd.to_datetime?

In [35]:
# convert following dates in to datetime
d1 = pd.Series(['23092012', '03092019'])
d2 = pd.Series(['12:45:55 pm 02232002', '11:40:55 pm 06022002', '12:04:55 am 11302002'])

In [33]:
d1

0    23092012
1    03092019
dtype: object

In [34]:
# series 1
pd.to_datetime(d1, format = '%d%m%Y')

0   2012-09-23
1   2019-09-03
dtype: datetime64[ns]

In [36]:
d2

0    12:45:55 pm 02232002
1    11:40:55 pm 06022002
2    12:04:55 am 11302002
dtype: object

In [37]:
# series 2
pd.to_datetime(d2, format = '%I:%M:%S %p %m%d%Y')

0   2002-02-23 12:45:55
1   2002-06-02 23:40:55
2   2002-11-30 00:04:55
dtype: datetime64[ns]

In [42]:
d3 = pd.Series(['34', '54', '66'])

In [43]:
d3

0    34
1    54
2    66
dtype: object

In [ ]:
# direct typecast not possible so give error

d3 + 100 --- error

In [47]:
# So, we will use to_numeric...it will not be problem even if the data is in float type
# Now after converting you can add 100 

pd.to_numeric(d3)

0    34
1    54
2    66
dtype: int64

In [46]:
pd.to_numeric(d3) + 100

0    134
1    154
2    166
dtype: int64

In [ ]:
1:33